 id |         name         |   phone    |      email      |  role  | balance | points | rating | driver_id | today_trips | today_earnings | total_trips | total_earnings |    date    
----+----------------------+------------+-----------------+--------+---------+--------+--------+-----------+-------------+----------------+-------------+----------------+------------
  6 | محمد                 | 0507654321 | driver2@ubar.sa | driver |  550.00 |     25 |   4.00 |         6 |          25 |          76.00 |         675 |         165.00 | 2026-02-09
  5 | أحمد عبدالله المالكي | 0501234567 | driver1@ubar.sa | driver |    0.00 |      0 |   5.00 |         5 |           0 |           0.00 |         423 |          45.50 | 2026-02-09
  7 | خالد أحمد القحطاني   | 0509876543 | driver3@ubar.sa | driver |    0.00 |      0 |   5.00 |         7 |           0 |           0.00 |         289 |           0.00 | 2026-02-09
(3 rows)

